[
  "table-editor-obsidian",
  "dataview",
  "obsidian-excalidraw-plugin",
  "obsidian-latex",
  "homepage",
  "mathpad",
  "obsidian-git",
  "quick-latex",
  "text-snippets-obsidian",
  "templater-obsidian",
  "obsidian-shellcommands",
  "tag-wrangler",
  "note-refactor-obsidian"
]