[
  "table-editor-obsidian",
  "dataview",
  "obsidian-excalidraw-plugin",
  "obsidian-latex",
  "homepage",
  "mathpad",
  "quick-latex",
  "text-snippets-obsidian",
  "templater-obsidian",
  "obsidian-shellcommands",
  "tag-wrangler",
  "note-refactor-obsidian",
  "settings-search",
  "omnisearch",
  "text-extractor",
  "obsidian-file-cleaner",
  "obsidian-local-images",
  "obsidian-git"
]