{"path":"External/Kasper's Notes/Robotters Fysik/PDF powerpoints/Lektion 1-Intro.pdf","text":"Fysik – lektion 1 SI enhedssystemet m.m. Introduktion til lektion 2 (næste gang) Første lektions emner: Kap. 2: Bevægelse langs en linje Kap. 4: Bevægelse i 2 og 3 dimensioner. Middelhastighed og øjeblikshastighed Bevægelse med konstant acceleration – det frie fald Projektilbevægelsen Jævn cirkulær bevægelse Relative bevægelser Videnskabelig metode Opgaveregning Fysik – lektion 1 Robotingeniør og fysik ? http://www.robotpark.com/All-Types-Of-Robots https://www.theverge.com/21317052/mobile-autonomous-robot-lab-assistant-research-speed Robotic lab assistant is 1,000 times faster at conducting research Working 22 hours a day, seven days a week, in the dark Robotic lab assistant, able to move around a laboratory and conduct scientific experiments just like a human https://youtu.be/dRT3tepdMyI Uni. Liverpool Videnskabelig metode i naturvidenskab Kræver målesystemer Mål hvad der kan måles, og gør det måleligt, som endnu ikke er det. Galileo Galilei: SI-enhedssystemet International standardisering af måleenheder under kontrol af: Systéme International d’Unités SI-enhedssystemet benyttes i det meste af verdenen undtagen USA. 7 grundlæggende SI-enheder for: Længde [meter] Masse [kilogram] Tid [sekunder] Elektrisk strøm [Ampere] Temperatur [Kelvin] Stofmængde [mol] Lysstyrke [candela] Plus mange andre afledte af disse syv SI-enheder! SI-enhedssystemet Definitionerne af enhederne i det nyligt vedtagende SI-enhedssystem er udtrykt ved 7 definerende konstanter Konstanternes værdi er konsistent med de bedste eksperimentelle værdier til rådighed ved vedtagelsen af de nye definitioner SI-enhedssystemetSI-enhedssystemetSI-enhedssystemetSI præfixerDet græske alfabet Lineær bevægelse - hastighed Strækning vs. tid for en bevægelse (2-1)Forskydning: Tidsinterval: 11(, )tx 22(, )t x x∆ t∆ Gennemsnitsfart i tidsintervallet ∆t: 21 middel 21 xx x v tt t − ∆ = = −∆ (2-2) Lineær bevægelse - hastighed Strækning vs. tid for en bevægelse Gennemsnitsfart i tidsintervallet t1 til t2 (0 til 6s): 21 middel 21 xx x v tt t − ∆ = = −∆ Øjeblikshastigheden til t=3 s: Hældning af tangenten i punktet C på x-t-kurven (t=3 s) x1 x2 t1 t2 () dx vt dt = (2-4) Lineær bevægelse - acceleration Gennemsnits- acceleration: Øjeblikkelig acceleration: (for t= 2s) Hastighed vs. tid Acceleration vs. tid (2-7) (2-9)(2-8) Lineær bevægelse - acceleration ()xt () dx vt dt = 2 2() dv d x at dt dt = = Sample problem 2.02 Elevator i opad bevægelse Lineær bevægelse - acceleration () () dv a t dv a t dt dt = ⇒= → 00 0 0() () vt t vt t dv a t dt v v v a t dt= ⇒∆ = − =∫∫ ∫ (2-27) () () dx v t dx v t dt dt = ⇒= → 00 0 0() () xt t xt t dx v t dt x x x v t dt= ⇒∆ = − =∫∫ ∫ (2-29) Lineær bevægelse – konstant accelerationLineær bevægelse – konstant acceleration 0 0 0 avg v v a a v v at t − = = ⇒ = + − (2-11) 0 0 0 avg avg xx v x x vt t − = ⇒= + − 0 00 0 11 1 ( )( ) 22 2 avgv v v v v at v at= + = + + = + 2 00 1 2 x x v t at= + + (2-15) Lineær bevægelse – konstant acceleration 0 0 v v v v at t a − = + ⇒=(2-11) 2 2 00 00 0 22 2 2 2 0 0 0 00 0 22 00 11 22 2( ) 2 2 2 2( ) v v v v x x v t at v a aa a x x vv v v v vv v v v v a x x −− −= + = + ⇔  − = − ++ − = − ⇔ = +− (2-15) (2-16) 0 0 v v v v at a t − = + ⇒ =(2-11) 220 00 0 0 11 1 () 22 2 v v x x vt at vt t v v t t − −= + = + = +  (2-15) eller 0v v at= − [ ] 22 00 1 1 1 2 2 2 x x v at v t vt at x x vt at− = − + = − ⇒= + −(2-18) Bevægelse i 3 dimensioner - position Position ˆˆˆr xi yj zk= ++  Eksempel ˆˆˆ( 3m) (2 m) (5 m)r i jk= − + +  (4-1) Forskydning 21rr r∆= −   (4-2) 2 2 2 11 1 2 1 2 1 21 ˆˆˆ ˆ ˆˆ() ˆˆˆ( )( ) ( ) ˆˆˆ r x i y jz k x i y jz k r x xi y y j z z k r xi yj zk ∆= + + − + + ∆= − + − + − ∆ = ∆ +∆ +∆    (4-4) Bevægelse i 3 dimensioner - hastighed Gennemsnitshastighed avg r v t ∆ = ∆   (4-8) ˆˆˆ avg xy z v i jk tt t ∆∆ ∆ = + + ∆∆ ∆  (4-9) 0 ( ) () ( ) lim ˆˆ ˆˆ t x y z rt t rt dr v t t dt dx dy dz v i j k dt dt dt v vi v j v k ∆→ +∆ − = = ∆ = ++ = ++       Øjebliksshastighed (4-11) Bevægelse i 3 dimensioner - acceleration Gennemsnitsacceleration 21 avg v vv a tt −∆ = = ∆∆    ˆˆˆ avg xy z v i jk tt t ∆∆ ∆ = + + ∆∆ ∆ (4-15) Øjebliksacceleration 0 ( ) () ( ) lim ˆˆ ˆˆ t yx z x y z v t t v t dv at t dt dvdv dv a i jk dt dt dt a a i a j a k ∆→ +∆ − = = ∆ = + + = ++      (4-18) Plan bevægelse - projektilbevægelsen Objekts bevægelse under indflydelse af tyngdekraften: Hastighedens x-komposant er konstant (ikke påvirket af g): Hastighedens y-komposant findes ved at benytte ligninger for konstant acceleration: 2( 9.82 m/s (dk))ya gg= −= 0 00 0 00cos ( cos )xxv v v xx v tθθ= = ⇒= + 21 0 0 0 0 0 0 2sin ( sin ) tyyv v gt v gt y y v gtθ θ= − = − ⇒ = + − (4-21) (4-22) Plan bevægelse - projektilbevægelsen 00 00 ( cos ) cos x xv t t v θ θ = ⇒= 2 21 0 0 0 02 00 00 2 0 2 00 1 ( sin ) t ( sin ) cos 2 cos 1 tan 2 ( cos ) xx y v gt v g vv g yx x v θθ θθ θ θ   = −= − ⇒     = −   Antager vi, at objektet kastes fra positionen fås: 00( , ) (0, 0)xy = (ligningen for en parabel)(4-25) Kastelængde: 2 0 0sin 2 v R g θ= Max højde: 2 20 0(sin ) 2 v H g θ= animation R H Jævn cirkulær bevægelse Beskrives ved polære koordinater: Radius: R Vinkel: Φ Buelængde: sR φ∆= ∆ Øjeblikkelig hastighed: ds d vR dt dt φ = = Vinkelhastighed: d dt φ ω ≡ vRω= Periodetid: 222RR T vR πππ ωω = = = Frekvens: 1 2 2 ff T ω ωπ π = = = Jævn cirkulær bevægelse Ændringen i hastighedsvektoren angiver retningen af : Ud fra de ligedannede trekanter i figurerne ses: v r v v r vr r ∆ ∆ = ⇔∆ = ∆ ⇒ v vr t rt ∆∆ = ∆ ∆ Den øjeblikkelige acceleration findes som: 2 2 00 lim lim t t v v r v v a v r t r t r r ω ∆→ ∆→ ∆∆ = = = = = ∆ ∆ 2 ˆ v ar r = −  avg v a t ∆ = ∆   (4-34) ˆr Relativ bevægelse En dreng står stille en bus og kaster en bold op. Observatører som bevæger sig i forhold til hinanden vil beskrive bevægelsen forskelligt. Relativ bevægelse PB PB BAr rr= +   PB PB BAv v v= +   PA PBaa=  (4-43) (4-44) (4-45) Næste gang: Newton’s Love Et legeme som ikke er påvirket af en kraft, eller af kræfter der ophæver hinandens virkning, vil enten være i hvile eller foretage en jævn retlinet bevægelse. Et legeme med massen m, der påvirkes af en resulterende kraft F, vil have en acceleration a, som opfylder: Et legeme A der påvirker et legeme B med en kraft, vil blive påvirket med en lige stor modsat rettet (Lov om aktion og reaktion) Newton’s Tredie Lov Newton’s Anden Lov Newton’s Første Lov F ma=  ","libVersion":"0.2.4","langs":""}