{"path":"Lessons/Semester 3/datacommunication/KOM - Lecture 3_a - Itslearning.pdf","text":"Data Communication (DC) Lecture 3a - Nodes and links - Services - Two categories of links - Link-layer addressing - Three types of addresses - Address Resolution Protocol (ARP) Overview of the contentsData Link layer The TCP/IP protocol suite does not define any protocol in the Data Link Layer or the Physical Layer. These two layers form the networks by themselves. When these networks are connected, they form the Internet.Data Link layer: The purpose of this layer is primarily to perform node-to- node communication. Data Link layer Nodes: hosts and routers. links: the networks in between nodes. Data Link layer • The sending node encapsulates the datagram in a frame. • The receiving node decapsulates the datagram from a frame. • Encapsulation and decapsulation are done for each intermediate node. • A frame is equipped with a header which contains the receiver and sender info. • Flow control • Framing Data Link layer: Services The Data Link Layer offers service to the Network Layer and receives Service from the Physical Layer Framing is the first service we have in the Data Link layer. Encapsulation of the datagram with the address information on the receiver and sender nodes. Data Link layer offers flow control to ensure that data does not flood a receiver node. The receiver node is given various options to ask the sender to stop or slow down. Flow control can also be also found in the Transport layer. • Error control The Data Link layer offers some types of error control including Error detection and Error correction. A frequently chosen solution is to discard a faulty packet and ask the sender for it to be resent. Error detection and correction is an issue in every layer. Data Link layer: Two Categories of Links It is the Data Link layer that controls how a medium is used. • Data Link layer can use the entire capacity of a link – point‐to‐point link • Data Link layer can use only parts of the capacity of a link – Broadcast link (multi‐access) Two Sublayers To better understand the service that Data Link layer offers. Then we divide the Data Link Layer into two sub-layers • Data Link Control (DLC) : this layer takes care of all the issues common to both point-to-point and broadcast links. • Media Acces Control (MAC) : Only deals with the issues specific to broadcast links. Data Link layer: Link-Layer Addressing Note: IP address order: sender - receiver MAC address order: receiver – sender Note also: the encapsulation from the different layers (network layer N and link layer L) • Unicast addressing: Unicast means one‐to‐one communication. A Unicast address is unique for a node: e.g. – A3:34:45:11:92:F1 • Multicast addressing: Multicast means one‐to‐many communication. Some link layers offer special multicast addresses. But these only apply within the same network and are therefore local. For multicast addresses, the second digit (the 2-digit number in A2) must be an even number, e.g. – A2:34:45:11:92:F1 • Broadcast addressing: Broadcast means one‐to‐all communication. This means that a frame is sent to all the nodes in a link/network, e.g., – FF:FF:FF:FF:FF:FF Data Link layer: Three types of addresses Data Link layer: ARP Address Resolution Protocol (ARP) • When an IP datagram is to be sent through the Internet, the IP addresses of the sender and receiver are known. • However, since the IP datagram is encapsulated and sent from link to link using the Data Link layer, it is essential for a host or router to be able to find the MAC address of the next router or receiver in the chain by using the known IP address of the next router or receiver. • The ARP protocol is used for this. When a host or router needs to find a Data Link layer address of another host or router in its network, an ARP request packet is sent. The package contains the IP and MAC address of the sender and the IP address of the receiver (the MAC address of the receiver is not known, but you want to find) The request is sent to a broadcast address so that it reaches all nodes in the local network. Data Link layer: ARP The intended node sends an ARP reply packet back to the sender as Unicast communication (one-to- one) Data Link layer: ARP‐ Package format Protocol address length: Depends on the selected Protocol type. Hardware address length: Depends on the selected Hardware type. Data Link layer: ARP‐ Package format Number Hardware Type 1 Ethernet 3 X.25 4 Proteon ProNET Token Ring 6 IEEE 802 Networks 7 ARCnet 11 Apple LocalTalk 14 SMDS 15 Frame Relay 16 ATM 17 HDLC 18 Fibre Channel 19 ATM 20 Serial Link Number Protocol Type 0x0800 IPv4 0x86DD IPv6 Data Link layer: ARP request/reply example 0x001=Ethernet; 0x0800=IPv4; 0x06=MAC‐address (6 bytes); 0x04=IP‐address (4 bytes in IPv4) Error in the book (N2) The forwarding table is located in the Network Layer ARP‐request ARP‐reply An example of communicationAn example of communicationAn example of communicationAn example of communicationAn example of communication","libVersion":"0.2.4","langs":""}