{"path":"Lessons/Semester 1/fysik/Lektion 09-FYS__RT_E22.pdf","text":"Fysik 1 – lektion 9 Dagens emne: Rotation af stive legemer, kap. 10. Rotation – vinkelhastighed, vinkelacceleration Rotationsenergi ( Krot ) Masse-inertimoment (rotational inertia) Parallel-akse teoremet – flytningsformlen Kraftmoment (torque) Frit-legeme analyse (igen) Arbejde, energi og effekt i rotation Analogi mellem translations- og rotationsbevægelse 1 Opgaveregning Rotation – vinkelhastighed Rotation om én akse kan beskrives ved én variabel: vinklen ()tθ Rotations- akse x-y-planet Middel-vinkelhastigheden bliver: ( ) () av tt t t θθ ω ∆ ∆ +− = Den øjeblikkelige vinkelhastighed bliver: 1() ˆ dt s dt θ ωω −=   Retningen af denne vektor findes ved højrehåndsreglen: 0= Er vinkelhastigheden konstant: ( ) bliver: tωω 00()ttθ θω= + retning 2 Vektor! Rotation – vinkelacceleration x-y-planet Middel-vinkelaccelerationen bliver: ( ) () av tt t t ωω α ∆ ∆ +− = Den øjeblikkelige vinkelacceleration bliver: 2 2 2 − = =   () ˆˆ  dt d s dt dt ωθ α ωω 0 2 00 22 00 1 2 2 () () () t t t tt ω ωα θ θω α ω ω αθ θ = + = ++ = +− For rotationer om én akse med konstant vinkelacceleration bliver rotationsligningerne analoge til ligningerne for én-dimensionale lineære bevægelser med konstant acceleration: 0 2 00 22 00 1 2 2 = + = ++ = +− () s( ) ( ) v t v at t s v t at v v a s s (1) (2) (3) 3 Relation mellem lineære og angulære størrelser s θ ( er målt i radianer!)srθθ= Et punkt P i afstanden r ifht. rotationsaksen bevæger sig afstanden s langs en cirkelbue: Punktets lineære hastighed findes ved: ds d v rr dt dt θ ω= = = Retningen af den lineære hastighed, v, er vinkelret på punktet P’s cirklebevægelse Retningen af den lineære acceleration, a, er lidt mere udfordrende, da der er to bidrag til accelerationen! 4 Rotation - acceleration Betragter vi igen et punkt P på det roterende legeme, og finder først den tangentiale acceleration: Den radiale (centripetale) acceleration er ved cirkelbevægelse som bekendt : 2 2 r v ar r ω= = Den totale acceleration: ( )t dv d d a r rr dt dt dt ω ωα= = = = ttot ra aa= +   r tota  ta  ra  P tota  5 Translation og rotation srθ= ()ds d r v r dt dt θ ω= = = ()dv d r ar dt dt ω α= = = Konstant acceleration, a Konstant vinkelacceleration, α Translation Rotation 6 Rotationsenergi Den kinetiske energi i rotationen kan findes ved at summere den kinetiske energi for hver del af et legeme: 21 2 ,i ii i i K K mv= =∑∑ ∆ 2 21 2 ii i K mR∆ω  = ⇒ ∑ Hvor I kaldes legemets (masse-) inertimoment mht. den specifikke rotationsakse: 2= ∑ ii i I mR∆ Vinkelrette afstand til rotations- aksen i ivR ω= 21 2 KIω= 2kg m ⋅  7 Masseinertimoment Figuren viser tre små kugler der roterer omkring en lodret akse. Den vinkelrette afstand mellem aksen og centrum af hver kugle er vist. Sorter de tre små kugler efter deres masseinertimoment, den mindste skrives først 1 m 36 kg 2 m 9 kg 3 m 4 kg A B C 8 Masseinertimoment Ønsker vi at finde et kontinuert legemes inertimoment, benyttes integration: 22 0→  = = ∑ ∫lim ii m i legeme I R m R dm ∆ ∆ 2 volumen I R dVρ= ∫ 2 flade I r dAσ= ∫ 2= ∫ linie x dxλ For 1-, 2- og 3-dimensionale legemer findes inertimomentet ud fra: dm’s vinkelrette afstand til rotationsaksen x dx kg mλ  r  dA 2 kg m σ      r  dVR 3 kg m ρ   dm dxλ= dm dAσ= dm dVρ= x, r og R er afstanden ifht. rorationsasken! 2= ∫ linie I x dm 9 Masseinertimoment for simple legemer 2=I MR ( ) 221 122= +I MR R 21 2=I MR 2211 4 12= +I MR ML 22 5=I MR 21 12=I ML 22 3=I MR 21 2=I MR ( ) 221 12= +I Ma b (a) (b) (c) (f)(e)(d) (g) (h) (i)Tabel 10.2 10 Masseinertimoment for massiv cylinder 21 2= ? I MR (c) 2= ∫I r dm x y dA r dr R = dm dA MA 2⇒=dA rdrπ 2 0 2= ∫ R M I r rdr A π 4 2 2 0 21 42   = =    R Mr MR R π π ⇒= M dm dA A 2=Arπ 2= M rdr A π 3 0 2 = ∫ R M r dr A π 11 Flytningsformlen Kendes et legemes inertimoment, I0 , mht. en rotationsakse igennem legemets massemidtpunkt (CM), kan inertimomentet, Ip, mht. en parallelforskudt rotationsakse findes ud fra flytningsformlen: 2 0= +pI I Md M = legemets totale masse d = afstanden mellem de to rotationsakser O og P Eftervisning: O CMII= 2 2 22 2′′= = +−∫ , cosPI r dm hvor r d r rd θ 22 2( cos )PI r d rd dmθ= +− ⇒∫ 22 2 cosPI r dm d dm d r dmθ= + − ⇒∫ ∫∫ 2 2P CMI I Md d xdm= +− ∫ Massemidtpunktets x-position = 0 2 P CMI I Md= + Parallel Akse 12 Cosinus relationer (hvis man har glemt dem!) 13 Masseinertimoment (igen) Figuren viser tre homogene kugler (radius 5 cm) der roterer omkring en lodret akse. Den vinkelrette afstand mellem aksen og centrum af hver kugle er vist. Sorter de tre kugler efter deres masseinertimoment, det mindste skrives først 1 m 36 kg 2 m 9 kg 3 m 4 kg A B C 22 5=I MR A: 36+2/5*36*R^2 B: 36+2/5*9*R^2 C: 36+2/5*4*R^2 14 Kraftmoment Årsagen til et legemes rotation er, at det bliver påvirket af et kraftmoment, .τ  Størrelsen af et kraftmoment er bestemt af en kraft, en ’momentarm’ og vinklen mel- lem disse to: ⊥= = =( sin ) sinr F r F rFτ φφ Eller som vektorligning, hvor retningen af kraftmomentet er givet ved højrehåndsreglen: F  rFτ = ×  = = =( sin ) sintrF r F rFτ φφ Fr → lineær bevægelse Ft → rotation om O 15 Kraftmoment - bevægelsesligninger En ekstern kraft, , virker på et element, i, af en stang. Vi antager at: iF  iiF r⊥   ia Opskrives Newton’s 2. lov for det i’te element, som får tagentialaccelerationen, : = = ⇒()ii ii iF ma m rα 2= = ⇒i i i iirF m rτα 2 = =  ∑∑i ii ii mrττ α Iτα=  iiF r⊥   Newton’s 2-lov for roterende systemer Vektorsummen af alle kraftmomenter = masseinertimoment gange vinkelaccelerationen 2= ∑ ii i I mr τ  16 Frit-legemeanalyse - igen 1. Identificér og isolér legemet, som de eksterne kræfter virker på. 2. Identificér de eksterne kræfter, som virker på legemet, og hvor kræfterne virker på legemet! 3. Skitsér et frit-legemediagram, hvor alle kræfter og deres angrebspunkt er indtegnet. Sidstnævnte er meget vigtigt mht. beregning af kraftmomentet. Bemærk: Tyngdekraften indtegnes med angrebspunkt i masse- midtpunktet. 4. Identificér en enkelt akse, som normalt vil være rotationsaksen for legemet. 5. Find kraftmomenterne omkring denne akse hidrørende fra de eksterne kræfter. Retningen af rotationen findes ud fra højrehåndsreglen. 6. Opskriv bevægelsesligningerne som indeholder netto-kraftmomentet. (dette indebærer ofte en udregning af legemets masseinertimoment, I, mht. rotationsaksen). 7. Netto-kraften bestemmer massemidtpunktets bevægelse! 17 Eksempel på Frit-legemeanalyse 12kgm = 88kg M = = 0, 5mR Find trissens vinkelhastighed efter at spanden er faldet i t=5 s. Frit-legemediagrammer med indtegnede kræf- ter skitseres. (For trissen i y-retningen: y −− = 0)NF T Mg For spanden i y’-retningen: − =mg T ma Rotations- akse y’ Kraftmomentet på trissen: trisseTR Iτα= = Trissens inertimoment: = 21 2trisseI MR Endvidere er sammenhængen mellem spandens acceleration, a, og trissens vinkelacceleration, α: aRα= 21 () 2 TR m g R R MRτ αα= = −= ⇔ [ ]( / 2) mg m M R α = + [ ] = += ⇒ + 0 ( / 2) mgt t m M R ωω α = 21 rad/sω 18 Arbejde og energi i rotation Arbejde-kinetisk energi-teorem for et roterende system: Som for konstant kraftmoment reduceres til: ⋅= ⋅= ⇒⋅∫∫   ff ii s s dF d R sW R θ θ τ θ Det udførte arbejde i en rotation omkring en fast akse: ( )= −fiW τ θ θ = ⋅∫  f i Wd θ θ τθ 2211 22= − = − =fi f iKK K I I W∆ ωω 19 Effekt i rotationsbevægelse Sammenhængen mellem arbejde og effekt er: = dW P dt 20 ⋅ = = ⋅= ⋅  dd P dt dt τθ θ τ τω Og dermed bliver: Analogi mellem fysiske størrelser i translations- og rotationsbevægelse Hooks lov: = −⋅fjF kx = −⋅fjτ κθ 21 Rotations- akse x-y- planet Opsummering Stift legemes rotation 1() ˆ dt s dt θ ωω − =    2 2 2 () ˆˆ s dt d dt dt ωθ α αα −= =   Rotationsvinkel: [ ]ˆ( ) ( ) radianerttθ θθ=  Vinkelhastighed: Vinkelacceleration: Enhedsvektorerne: ˆ ˆˆ, og er defineret således at:θω α Rotation mod urets retning: Positiv Rotation med urets retning: Negativ 22 Analogi mellem translation og rotation ved konstant acceleration og konstant vinkelacceleration Opsummering Inertimoment 2 ii i I mR≡∆∑ Vinkelrette afstand til rotations- aksen 2kg m ⋅  23 Flytningsformlen Opsummering 21 2 KIω= 2 p CMI I Md= + parallel Rotationsenergi M = legemets totale masse d = afstanden mellem de to rotationsakser O og P ICM = Inertimoment ifht. rotationsakseigennem CM 24 Kraftmoment Opsummering F rFτ = ×  net Iτα=  Newton’s 2. lov for roterende bevægelse 25 Frit-legemeanalyse inklusiv rotation Opsummering 1. Identificér og isolér legemet, som de eksterne kræfter virker på. 2. Identificér de eksterne kræfter, som virker på legemet, og hvor kræfterne virker på legemet! 3. Skitsér et frit-legemediagram, hvor alle kræfter og deres angrebs-punkt er indtegnet. Sidstnævnte er meget vigtigt mht. beregning af kraftmomentet. Bemærk: Tyngdekraften indtegnes med angrebspunkt i masse-midtpunktet. 4. Identificér en enkelt akse, som normalt vil være rotationsaksen for legemet. 5. Find kraftmomenterne omkring denne akse hidrørende fra de eksterne kræfter. Retningen af rotationen findes ud fra højre-håndsreglen. 6. Opskriv bevægelsesligningerne som indeholder netto-kraftmomentet. (dette indebærer ofte en udregning af legemets inertimoment, I, mht. rotationsaksen). 7. Netto-kraften bestemmer massemidtpunktets bevægelse! y y’ 26 f i Wd θ θ τθ= ⋅∫  2211 22fi f iK K K I I Wωω∆ = − = − = Arbejde-energi teorem Opsummering Mekanisk effekt i rotationsbevægelse dW d P dt dt τθ τω ⋅ = = = ⋅   27 Opsummering Analogi mellem fysiske størrelser i translation og rotation Hooks lov: = −⋅fjF kx = −⋅fjτ κθ 28 Næste lektion: Pendulbevægelsen og rulning. Det fysiske pendul Det matematiske pendul Torsionspendul Fysisk versus matematisk pendul Pendul med store udsving Rulning Fysik 1 – lektion 10 2= I T Mgr π 2930 Hjemmeforberedelse opgaver: 31 Opgave på klassen 32 Opgave på klassen","libVersion":"0.2.4","langs":""}