{"path":"Lessons/Semester 3/multivariate-math/gamle_eksamensaet/reeksamen_E2021.pdf","text":"RB-MSI3 MAT / RD-MMR Efterår 2021 Reeksamen 14/2 2022 Praktisk information MAT besvarelsen a˛everes via Digital Eksamen og der skal a˛everes én pdf-˝l, der indeholder besvarelsen af alle MAT opgaver. Håndskrevne bilag skal digita- liseres. Du kan digitalisere disse bilag fx vha. en mobiltelefon/tablet, en hånd- skanner, en digital pen eller et digitalkamera (SD-kort skal være tomt ved prøve- start). Hvis du digitaliserer dine håndskrevne bilag med en mobiltelefon/tablet, skal du være opmærksom på, at mobiltelefonen/tablet sidestilles med en compu- ter og må derfor ikke medtages, hvis du forlader prøvelokalet, før prøven er slut. Mobiltelefonen/tablet skal være i ˛ytilstand under hele eksamen, og bluetooth eller wi˝ må ikke aktiveres under eksamen. Husk at medbringe et datakabel til overførsel af billederne. HUSK at opskrive formler før de anvendes samt at medtage alle detaljer i ud- regningerne. Opgavesættet består af 4 opgaver, der tilsammen giver 100 point. 1 Opgave 1 (20 point) Beregn volumen af det område, der er beskrevet ved ulighederne: z ≤ −x2 − y2 + 10 z ≥ x − 2y − 5 x2 + y2 ≤ 1 x ≤ 0 Opgave 2 (30 point) Betragt kurven C, der ligger i planen z = 0 og er den øvre del af cirklen med centrum i (0, 2, 0) og har radius 2. Kurven starter i (2, 2, 0) og slutter i (−2, 2.0). Se skitse herunder. a) Beregn ∫ C F · dr hvor vektorfeltet F er givet ved F =   y + z x x   Hint: undersøg om F er konservativt. b) Beregn ∫ C f (x, y, z)ds hvor f (x, y, z) = x + y + z. 2 Opgave 3 (30 point) Betragt over˛aden S, der er parametriseret ved r(t) =   u cos(v) u sin(v) u   hvor 0 ≤ u ≤ 2 og 0 ≤ v ≤ π. Betragt også vektorfeltet F =   −xz −yz z   a) Beregn arealet af S. b) Beregn ˛uxen af F opad gennem S. Opgave 4 (20 point) Betragt den partielle di˙erentialligning uyy − uxx = 0 Klassi˝cer ligningen, omskriv den til normal form ved at gennemføre et passende variabelskift. Løs den fremkomne ligning, løsningen skal skrives som funktion af x og y. 3","libVersion":"0.2.4","langs":""}