{"path":"Lessons/Semester 3/datacommunication/KOM - lecture 4b - Itslearning.pdf","text":"Data Communication (DC) Lecture 4b - High-level Data Link Control (HDLC) • Configurations and transfer modes • Framing Overview of the contents Data Link layer HDLC High-Level Data Link Control (HDLC) is a bit-oriented protocol. It can communicate via both Point-to-Point and Multi-point links. It implements the Stop-and-Wait protocol and contains ARQ. Although this protocol is more a theoretical issue than practical, most of the concept defined in this protocol is the basis for other practical protocols such as PPP or the Ethernet protocol. This protocol contains two transfer modes: • Normal Response Mode (NRM) • Asynchronous Balanced Mode (ABM) Data Link layer HDLC In Normal Response Mode (NRM) the station configuration is unbalanced. That is, we have a primary station and one or more secondary stations. • The primary station can send commands. • Secondary stations can only respond. • The configuration can be point-to-point or multi-point links. Data Link layer HDLC In Asynchronous Balanced Mode (ABM) the station configuration is balanced. That is, we have a point-to-point connection with two equal stations, both of which can send commands and respond to them. This transfer mode is the most widely used today. Data Link layer HDLC Frames – three types • I-frame: Information frames (data transport) • S-frame: Supervisory frames (control messages) • U-frame: Unnumbered frames (management messages) Data Link layer HDLC Frames - Fields Flag field: The field has a length of 8-bit with a pattern: 01111110. The field is used both at the beginning and in the end of a frame. The flag also serves as a synchronization pattern for the receiver. Data Link layer HDLC Frames - Fields Address field: This field contains the address of the secondary station that is to receive the HDLC Frame if it is transmitted from a primary station. If it's a response from a secondary station to a primary station, then contains the field address from the secondary station. Data Link layer HDLC Frames - Fields Control field: This field is 1-2 bytes long, it is used for flow and error control. The interpretation of the individual bits depends on the frame type. We will take a closer look at this field later. Data Link layer HDLC Frames - Fields Information field: This field contains the user's data obtained from the network layer. It may also contain management information. The length of the field may vary from network to network. FCS field: This field is called the Frame Check Sequence (FCS) and contains the HDLC Frame's CRC check, it is used for error detection. The field is either 2- or 4-byte long. Data Link layer HDLC Frames - Fields Data Link layer HDLC Frames - Fields: Control field Control field for I-Frames Frames are designed to transmit user data. These Frames can also contain flow and error control information (piggybacking). • Bit 0: defines the type (I-Frame) and is always 0 • Bit 1 - 3: is called N(S) and defines a sequence number for the frame. Here you can have sequence numbers between 0 and 7. But if the extended version of the control field (2 bytes) is used, there can be more sequence numbers. • Bit 4: the P/F bit can have two meanings: o Server to client: (Request) here the meaning P=Poll is used. P is \"0\" for all frames except the last one, where P = 1. This indicates that there is a \"poll\" for a response from the client. o Client to Server: (Response) here the meaning F=Final is used. F is \"0\" for all frames except the last one, where F = 1. This indicates that it is the \"Final\" frame from the client. • Bit 5 - 7: is called N(R) and defines an acknowledgment number when using piggybacking. Data Link layer HDLC example P/F bit Multi-pointMulti-point Data Link layer HDLC example P/F bit Data Link layer HDLC Frames - Fields: Control field Control field for S-Frames The Supervisory Frame is used for flow and error control when it is not possible or appropriate to use piggybacking (e.g., if a station itself does not have something it should have sent). • Bit 0 - 1: defines the type (S-Frame) and is always 10. • Bit 2 - 3: type code: o 00 = Receive Ready (RR) an ACK for error-free reception of a frame or group of frames. o 01 = Reject (REJ) a NAK negative acknowledgment (not as in selective repeat ARQ), but it can be used in Go-Back-N ARQ to inform a sender before a timeout occurs. This will make the protocol more efficient. o 10 = Receive not Ready (RNR) an ACK for error-free reception of a frame or group of frames. But the receiver is busy now and can not receive any more right now. it acts as a congestion-control mechanism. o 11 = Selective reject (SREJ) a NAK negative acknowledgment that can be used in the Selective Repeat ARQ protocol. Data Link layer HDLC Frames - Fields: Control field Control field for S-Frames (continued) • Bit 4: The P/F bit can have two meanings: o Server to client: (Request) here the meaning P = Poll is used. P is \"0\" for all frames except the last one, where P = 1. This indicates that there is a \"poll\" for a response from the client. o Client to Server: (Response) here the meaning F = Final is used. F is \"0\" for all frames except the last one, where F = 1. This indicates that it is the \"Final\" frame from the client. • Bit 5 - 7: is called N(R) and defines an acknowledgment number (ACK) or a negative acknowledgment number (NAK). This depends on the type of S- Frame, as indicated in bits 2 and 3. Data Link layer HDLC Frames - Fields: Control field Control field for U-Frames Unnumbered Frames are used to exchange session management and control information between connected devices. Like a S-Frame, this Frame also contains an information field. However, this is not used for user data, but for management data. Data Link layer HDLC: Connect/disconnect SABM: Set Asynchronous Balanced Mode DISC: Disconnect UA: Unnumbered Acknowledgment Data Link layer HDLC: Piggybacking without errors Here it says incorrectly 2 is used in the book Data Link layer HDLC: Piggybacking with errors","libVersion":"0.2.4","langs":""}