{"path":"Lessons/Semester 3/datacommunication/KOM - lecture 4c - Itslearning.pdf","text":"Data Communication (DC) Lecture 4c - Point-to-Point Protocol (PPP) • Services • Framing • Transition phases • Multiplexing Overview of the contentsData Link layer Point-To-Point Protocol (PPP) PPP offers various services: 1. PPP defines the format of the frames exchanged between devices. 2. PPP defines how two entities can negotiate the establishment of a link and the exchange data. 3. PPP defines how data from the Network layer is encapsulated in the Data Link Frame. 4. PPP defines how two devices can verify the authenticity of each other. 5. PPP offers services to the Network layer, which supports a large selection of Network layer protocols. 6. PPP provide connection over multiple parallel links (new version called multilink PPP). 7. PPP offers network address configuration, which is extremely useful when a home user needs a temporary network address to connect to the Internet. Data Link layer Point-To-Point Protocol (PPP) Services not provided by PPP: 1. PPP does not offer flow control. A sender can send several frames to a receiver without knowing if the receiver is able to handle them. 2. PPP has a very simple error check. A CRC field is used to detect errors. If a frame is defective, it is simply discarded. The layers above the Data Link layer must take care of these problems. Lack of error control and sequence numbering may cause a packet to be received out of order. 3. PPP does not offer a sophisticated addressing mechanisms to handle frames in a multipoint configuration. Note: PPP is a byte-oriented protocol. Data Link layer PPP Frame format Flag: A PPP Frame starts and ends with a byte flag, which has the bit pattern of 01111110. Although this pattern is the same as in the HDLC protocol, there is a big difference: HDLC is bit-oriented while PPP is byte-oriented. The flag is thus handled as a byte. 00000011 Data Link layer PPP Frame format Address: The address field in this protocol is a constant with the value 11111111 (broadcast address). Through negotiation, the two entities may agree to omit this field. 00000011 Data Link layer PPP Frame format Control: This field is also set to a constant 00000011 (imitating unnumbered frames in HDLC). As we will see later, PPP does not offer flow control and error control is limited to detection. This means that the field is not used, and through negotiation, the two entities can agree to omit this field. 00000011 Data Link layer PPP Frame format Protocol: The protocol field defines what the contents of the data field are (either user data or other information). This field is 2 bytes long, but the two devices can negotiate to use only 1 byte for this field. 00000011 Data Link layer PPP Frame format Payload: This field contains user data and other information. The field is a sequence of bytes but a default maximum of 1500 bytes. But this can be changed by negotiation by the two entities. 00000011 Data Link layer PPP Frame format FCS: Frame Ckeck Sequence (FCS) is a 2-byte or 4-byte field and is used for standard CRC. 00000011 Data Link layer PPP Frame format Byte Stuffing Since PPP is a byte-oriented protocol, the flag must be escaped whenever it appears in the frame data (payload) section. The byte used as Esc code is 01111101. Thus, this Esc byte is inserted before the flag (or another Esc byte) in the data section, by the sender. It is removed again on the receiver side. 00000011 Data Link layer PPP Transition Phases Dead: In this phase, the link is not used (i.e., there is no active carrier at the physical layer). The line is quiet. Data Link layer PPP Transition phases Establish: When one of the nodes starts the communication, the connection enters this phase. In this phase, different options are negotiated between the two nodes. Data Link layer PPP Transition phases Authenticate: This phase is optional. If it is used, then some authentication frames are sent. Data Link layer PPP Transition phases Network: In the network phase, the network layer protocol is negotiated. PPP specifies that the two nodes must have an agreement on the network layer before data can be exchanged between the network layers of the nodes. This is done because PPP supports many of the network layer protocols. If a node uses the protocols of several different network layers, then the receiver must know which protocol will be used for receiving the data. Data Link layer PPP Transition phases Open: In this phase, data transmission will take place. When a connection reaches this stage, then the exchange of data packets can take place. The connection remains in this phase until one of the nodes wants to terminate the connection. Data Link layer PPP Transition phases Terminate: In this phase, the connection is terminated. Several frames are exchanged between the nodes in this phase to clear and close the link properly. The system remains in this state until the carrier (physical-layer signal) is dropped, which moves the system to the dead state again. Data Link layer PPP Multiplexing Although PPP is a Data Link layer protocol, PPP uses another set of protocols. These protocols are defined to make PPP powerful: • One Link Control Protocol (LCP) • Two Authentication Protocols (PAP and CHAP) • Several Network Control Protocols (e.g., IPCP) Data Link layer PPP Link Control Protocol Link Control Protocol (LCP) is responsible for: • Establishment of links. • Maintenance of links. • Configuration of links. • Termination of links. The protocol also offers negotiation mechanisms to set different options between the two endpoints. Both nodes must reach an agreement about the options before a link is established. All LCP packets are carried in the payload field in the PPP frame with the protocol field set to C021 in hexadecimal. Note: The ID field is inserted with a value by the Request node and copied by the Reply node. Data Link layer PPP Link Control Protocol: The code field Data Link layer PPP Link Control Protocol: information field (setting options) There are many setting options that can be negotiated by two endpoints. These options are inserted in the information field of the configuration packets. The information field will be divided into three fields: • Option type • Option length • Option data Here are some of the most common options: Type Length 1 2 7 8 4 ≥4 2 2 Data Link layer PPP Authentication Protocols Authentication plays an important role in PPP, as PPP is designed for use over dial-up links, where the user's identity is necessary to know if the user wants to access different resources in a system. PPP offers two protocols for this purpose. • Password Authentication Protocol (PAP) • Challenge Handshake Authentication Protocol (CHAP) Data Link layer PPP Authentication Protocols: PAP 1. The user who wants to access a system sends an Authentication request with username and password. 2. The system examines the validity of user and password. The connection is either accepted or rejected. Data Link layer PPP Authentication Protocols: CHAP 1. The system sends the user a challenge packet containing a challenge value, usually a few bytes. 2. The user applies a predefined function that takes the challenge value and the user’s own password and creates a result. The user sends the result in the response packet to the system. 3. The system does the same. It applies the same function to the password of the user (known to the system) and the challenge value to create a result. If the result created is the same as the result sent in the response packet, access is granted; otherwise, it is denied. CHAP is more secure than PAP, especially if the system constantly changes the challenge values. Even if an intruder learns the challenge value and the result, the password is still secret and then the system is still safe since the challenge value will never be the same. Data Link layer PPP Authentication Protocols: CHAP Data Link layer PPP Network Control Protocols PPP supports many of the network layer protocols, for example: • Internet • OSI • Xerox • DECnet • AppleTalk • Novel • And so on To do this, PPP has defined a specific Network Control Protocol (NCP) for each Network Protocol. E.g.: • IPCP (Internet Protocol Control Protocol) configures a connection that can carry IP data packets. • Xerox CP does the same for Xerox • And so on Note that none of the NCP packets carry network-layer data, they just configure the link at the network layer for the incoming data. Data Link layer PPP Network Control Protocols: Example IPCP IPCP defines 7 different packets, which are distinguished by the value in the code field. Data Link layer PPP Network Control Protocols: Other Protocol There are other NCP protocols for setting up other Network Layer protocols. E.g. • OSI network layer control protocol has a protocol field value of 0x8023 • Xerox NS IDP control protocol has a protocol field value of 0x8025 • And so on but all have the same codes and format. Data Link layer PPP: Data from the Network layer When the setup of the connection to the Network layer is completed by one of the selected NCP protocols, then data packets can be exchanged from the network layer. Here again, there are different protocol field values for different network layers. If the PPP carries data from the IP network protocol, then the value in this field is 0x0021 (note that the 3 rightmost digits are the same as for IPCP, i.e., 0x8021) Data Link layer Multilink PPP One logical PPP frame can be divided into several fragments, which are carried as payload of actual PPP frames and transmitted through multiple channels. To show that the actual PPP Frame carries a fragment of a logical frame, the protocol field is set to 0x003D. In addition, the PPP Frame must also have a sequence number to indicate the position of the fragment in the logical PPP Frame. Data Link layer PPP example The book incorrectly used 01 here","libVersion":"0.2.4","langs":""}