{"path":"Lessons/Semester 3/multivariate-math/gamle_eksamensaet/Reeksamen_E2019.pdf","text":"RB-MSI3 MAT Re-eksamen 27/2 2020 Praktisk information MAT besvarelsen a˛everes via SDU Assignment og der skal a˛everes én pdf-˝l, der indeholder besvarelsen af alle MAT opgaver. Håndskrevne bilag skal digita- liseres. Du kan digitalisere disse bilag fx vha. en mobiltelefon/tablet, en hånd- skanner, en digital pen eller et digitalkamera (SD-kort skal være tomt ved prøve- start). Hvis du digitaliserer dine håndskrevne bilag med en mobiltelefon/tablet, skal du være opmærksom på, at mobiltelefonen/tablet sidestilles med en compu- ter og må derfor ikke medtages, hvis du forlader prøvelokalet, før prøven er slut. Mobiltelefonen/tablet skal være i ˛ytilstand under hele eksamen, og bluetooth eller wi˝ må ikke aktiveres under eksamen. Husk at medbringe et datakabel til overførsel af billederne. Når eksamen er slut skal du have scannet alle dokumenter, men har ca. 10 min til at samle materialet i en PDF. Alle data skal være genereret inden og det er KUN samlingen af den endelige ˝l, der må foregå herefter. Upload kan foretages når eksamen slutter. HUSK at opskrive formler før de anvendes samt at medtage alle detaljer i ud- regningerne. Opgavesættet består af 4 opgaver, der vægtes ligeligt. 1 Opgave 1 Beregn volumen af det område, der afgrænses af planet z = 0 og over˛aden beskrevet ved ligningen z = 9 − x2 − y2 Opgave 2 Beregn ∫ C F · dr hvor vektorfeltet F er givet ved F =   z + 1 xz −x   og kurven C starter i puntet (0, 0, −1) og følger en halvcirkel i planet y = 0 til punktet (0, 0, 1). Se skitse herunder. Opgave 3 Beregn over˛adeintegralet ∫ ∫ S f (x, y, z) dS hvor f (x, y, z) = 3xz og S er den del af planet z = 10 − 2x − y, der ligger i 1. oktant (dvs. x ≥ 0, y ≥ 0 og z ≥ 0). Opgave 4 Betragt di˙erentialligningen 2y′′(t) − y′(t) = 2 exp(−2t) hvor y(0) = 0 og y′(0) = 0. Brug nu Laplacetransformation til at løse ligningen og således bestemme y(t). 2","libVersion":"0.2.4","langs":""}