{"path":"Lessons/Semester 1/fysik/Lektion 10-FYS1_2022.pdf","text":"Dagens emne: Pendulbevægelsen og rulning. Det fysiske pendul (Det matematiske pendul) Fysisk versus matematisk pendul Pendul - store udsving Rulning Fysik 1 – lektion 10 Repetition 1 Rotations- akse x-y- planet Repetition Stift legemes rotation 1() ˆ dt s dt   −=  2 2 2 () ˆˆ s d t d dt dt     −==  Rotationsvinkel:  ˆ( ) ( ) radianertt  = Vinkelhastighed: Vinkelacceleration: Enhedsvektorerne:ˆ ˆˆ, og er defineret således at:   Rotation mod urets retning: Positiv Rotation med urets retning: Negativ 2 Analogi mellem translation og rotation ved konstant acceleration og konstant veinkelacceleration Masseinertimoment 2 ii i I m R Vinkelrette afstand til rotations- aksen 2kg m Repetition 3 Flytningsformlen 21 2 rotKI= 2 p CMI I Md=+ parallel Rotationsenergi M = legemets totale masse d = afstanden mellem de to rotationsakser O og P ICM = Inertimoment ifht. rotationsakseigennem CM Repetition 4 Kraftmoment Årsagen til et legemes rotation er, at det bliver påvirket af et kraftmoment, .  Størrelsen af et kraftmoment er bestemt af en kraft, en ’momentarm’ og vinklen mel- lem disse to: Eller som vektorligning, hvor retningen af kraftmomentet er givet ved højrehåndsreglen: F rF = = = =( sin ) sintrF r F rF   5 Kraftmoment - bevægelsesligninger En ekstern kraft, , virker på et element, i, af en stang. Vi antager at: iFiiFr⊥ia Opskrives Newton’s 2. lov for det i’te element, som får tagentialaccelerationen, : = = ()i i i i iF m a m r 2= = i i i i ir F m r 2 ==  i i i ii mr   I=iiFr⊥ Newton’s 2-lov for roterende systemer Vektorsummen af alle kraftmomenter = masseinertimoment gange vinkelaccelerationen 2=  ii i I m r  6 f i Wd   = 2211 22f i f iK K K I I W = − = − = Arbejde-energi teorem Mekanisk effekt i rotationsbevægelse dW d P dt dt    = = =  Repetition 7 Matematisk pendul Positionen på cirkelbuen: Hastigheden langs cirkelbuen: Tangential accelerationen: Kan også findes ved at se på kræfterne, som påvirk- er pendulet. 8 Matematisk pendul Tangential-accelerationen: Af fritlegeme-diagrammet fås: tan sinF mg ma= − = Hvorved: 2 2 sin d lg dt  =− Hvis der på højre side havde stået –gθ havde vi ”opskriften” på en harmonisk svingning. Hvornår gælder: sin ? tanF 9 2 Matematisk pendul sin og xs ll ==   sin xs Sidstnævnte kan ses, at gælde for små vinkler, θ, hvilket også ses af Taylorrække-udviklingen for sinθ: 35 35 sin !!  = − + −  Hermed fås: 22 22= −  −  = − sin d d g l g g dt dt l     0 sin( )t   =+ 1 2 2 = = =,, g l g Tf l g l   10 Matematisk pendul - energiforhold Kinetisk energi: 22 221 1 1 2 2 2     = = =        () dd K mv m l ml dt dt   Potentiel energi 1( ) ( cos )U mgh mgl= = − Benyttes de første led i Taylorrække- udviklingen for cosinus: 2 1 2 cos( )    −  2211 11 22 ( ) ( )U mgh mgl mgl  = = − + = 11 Fysisk pendul Ethvert legeme som er ophængt i et punkt, som er forskudt i forhold til massemidtpunktet, kan svinge pga. kraftmomentet: trF =  tFrF⊥ ⊥= = =sin sintr F MgF r r   Endvidere gælder for rotationen: I=− 2 =   =  2 masseinertimomentet d = vinkelaccelerationen I dt   For små vinkler, θ, fås: 2 2 = −  () () d t Mgr t dt I   0( ) sin( )tt   =+ 2==, Mgr I T I Mgr   + sin 12 y x y=sin(x) y=x 13 35 35 sin !!  = − + −   (deg)  (rad) sin() 0 0 0 10 0,175 0,174 20 0,349 0,342 30 0,523 0,500 Fejl % 0 0,5 2 5 Fysisk vs. matematisk pendul 2=Fys I T Mgr  Ml 2MatI Ml 2 22==Mat Ml l T Mgl g  rl Reduceret pendullængde=RP I l mr  Fysisk pendul: Matematisk pendul: 2= RP Fys l T g  14 Pendul, store udsving Opskriv den samlede mekaniske energi for systemet ( ) 21 2 1= + = + − cosMek Rot PotE E E I mgL( ) 2 1 1 2  = + −  cos d m L mgL dt   Til t=0 er massen løftet op til en vinkel 0 i forhold til lodret( ) ( ) 2 0 1 11 2  − = + −  cos cos d mgL m L mgL dt  ( ) 2 00 12 2  − = −  = −  cos cos cos cos d d g g L g dt dt L      = = = +, , ,efter , ,Mek start Pot start Mek Rot efter Pot efterE E E E E 15 L Benyt: ( ) ( ) 022 0221 2 1 2= − = −cos sin cos sinog ( ) ( ) ( )( ) 022 0 22 24 = − = −cos cos sin sin d g g dt L L    Pendul, store udsving ( ) ( )( ) 022 00222= − =sin sin , dg dt L    Denne lign. integreres fra =0 til =0 , en kvart periode ( ) ( )( ) 0 0 4 0 0 22 000 22 2 2 = = = −  / sin sin T TdT dt T      16 Pendul, store udsving ( ) ( )( ) 0 0 200 0 22 0 22 2 2  ==  −  sin sin sin Ellip T d T T F     Hvor FEllip er et elliptisk integrale af 1. type, der kun kan løses numerisk. I Matlab hedder FEllip[ ]: ellipke( ), i Mathematica: EllipticK[] 2 2 2 2 4 60 0 0 0 1 1 3 1 3 5 1 2 2 2 4 2 2 4 6 2              = + + + +                       sin sin sin ... T T    Alternativt række udvikling…. 2 0 0 1 1 42  +  sin T T  Eller:0 0 1 2  cos( ) T T  17 Pendul, store udsving >> th=0:0.5:90; % begyndelsesvinkel >> k=sind(th/2); % def. af k >> M=(2/pi)*ellipke(k.^2); % beregning af elliptisk integrale >> plot(th, M, 'LineWidth',2) >> xlabel('Begyndelsesvinkel i grader') >> ylabel('T_aktuel/T_ideel‘) >> grid on 0 10 20 30 40 50 60 70 80 90 1 1.02 1.04 1.06 1.08 1.1 1.12 1.14 1.16 1.18 1.2 Begyndelsesvinkel i graderTaktuel/Tideel 50 startvinkel giver kun ca. 5 % fejl på periodetiden!! 18 Rulning Rulning er en kombination af rotation og lineær bevægelse. Hjulet roterer om sin akse (rød lysdiode) og aksen bevæger sig retliniet (hvid lysdiode). 19 Rulning Rulning kan betragtes som rotation om kontaktpunktet P. P kaldes også det øjeblikkelige omdrej- ningspunkt. Er hjulnarvets hastighed v, så er hjulnar- vets vinkelhastighed omkring P:==; hjulets radius v R R  Ethvert punkt på hjulet har samme vinkel- hastighed omkring P. Derved får hjulets toppunkt hastigheden: 2 2 2top v v R R v R = = = 20 Energien i rulning I forhold til det øjeblikkelige omdrejnings- punkt, udfører hjulet en ren rotation, hvorved den totale kinetiske energi bliver: 21 2 contactKI = hvor Icontact er hjulets masseinertimoment mht. en akse som går igennem P. 2 contact CMI I MR= +  Ud fra flytningsformlen fås: ( ) 221 2 CMK I MR = +  2211 22 CMK I Mv=+ Rotationsenergi Translationsenergi 21=+rul rot transK K K Rulning, bevægelsesligninger Er der friktion mellem cylinderen og underlaget, vil den statiske friktions- kraft være årsagen til cylinderens rulning. Ingen skridning Ingen glidning Newton’s 2. lov på den translatoriske bevægelse: sinMa Mg f=− Kraftmomentet hidrørende fra friktionskraften: fR I== Sammenhæng mellem rotation og translation: aR= 22 Rulning, bevægelsesligninger Fra forrige slide: sinMa Mg f=−fR I= = aR= I f R  = og sin I M R Mg R   = −  2 sinMgR MR I   = + hvorved = + = + + 00 2 sinMgR tt MR I      Endvidere er: = = + + 2 0 2sin MR v R v g t MR I = + = + + 2 2 2 2 00 22 2 sin MR v v al v g l MR I  Disse ligninger gælder for cylinderen, som ruller ned af et hældende underlag. Lad os undersøge situationen mere generelt for andre legemer, som kan rulle nedad på et hældende underlag. 23 Rulning, bevægelsesligninger Fra forrige slide haves for cylinderen: 0 2 sinMgR t MR I  =+ + For et homogent legeme med masse M og radius R, og som er symmetrisk omkring en akse (lig eller parallel med rotationsaksen) gælder: 2I CMR= hvor C>0, er bestemt af legemets geometri (se tabel 10.2). Benyttes denne sammenhæng fås at: 0 ( / )sin 1 gR t C  =+ + 0 sin 1 g v v t C  =+ + 22 0 sin 2 1 g v v l C  =+ + Sammenlignes sidste udtryk med hastigheden for et legeme, som bevæg- er sig ned af en rampe uden friktion (glider): 22 0 2 sinv v g l=+ så ses det at: Det rullende legeme bevæger sig langsommere, da noget af den poten- tielle energi bliver omsat til rotationsenergi. Bemærk, at ren glidning svarer til C=0 (ingen rotation) 24 Masseinertimoment for simple legemer 2=I MR ( ) 221 122=+I M R R21 2=I MR2211 4 12=+I MR ML 22 5=I MR 21 12=I ML 22 3=I MR21 2=I MR( ) 221 12=+I M a b (a) (b) (c) (f)(e)(d) (g) (h) (i)Tabel 10.2 25= 1C = 1 2C = 2 5C = 1 12C = 1 2C = 2 3C Rulning Forsøg og forklaring Tre legemer, en kugle, en cylinderskive og en cylinderring, med samme radius slippes samtidig på toppen af rampen. Hvilket legeme når først ned? Udgangspunktet er ligningen for accelerationen: = = = ++ 2 22 sin sin 1 / ( ) MgR g aR MR I I MR   For cylinderskiven: For cylinderringen:  =   = = = + 2½ sin 2 sin 0, 67 sin 13½ CS CS I MR g a g g    =   = = = + 2 sin 1 sin 0.5 sin 121 CR CR I MR g a g g   (hurtigst) For kuglen:  =   = = = + 2 22 5 5sin 5 sin 0, 71 sin 17 K K I MR g a g g   26 Næste gange, lektion 11 og 12 Generalisering af bevægelsesmængdemoment Kraftmoment (igen) Bevarelse af bevægelsesmængdemoment Bevægelsesmængdemoment 27 Fysikøvelse i to omgange kl. 8-10 og kl. 10-12; 5 hold a 3-4 personer. I alt 10 grp. Lektion 12: Lektion 11: Opgaver 15P100. (ekstra) Vis at periodetiden T er: 3 2 2 = M T k  Cylinder, rulning =+ ;E K U 2211 22=+øE I kx0= dE dt 2=+ø CMI I MR 2 2 231 22= + =MR MR MR( ) 2 211 22=+ v ø RI kx 11 222 22=   +   øIdE dv dx v k x dt R dt dt 2 0=   +   = øI v a k x v R 2 2 = −  = − ø R a k x x I 2 =T   22=  øI Rk  3 2 2 = M k  28 Opgaver OPGAVE 15. En kugle fastholdes på et skråplan, der hælder 7° med vandret. Til tiden t0 =0 slippes kuglen, som derefter - uden at glide - ruller ned ad skråplanet. Kuglens masse er m = 12 g, og dens diameter D= 30 mm. a) Beregn den mindste værdi, som den statiske friktionskoefficient må antage, for at forsøget kan gennemføres? b) Beregn kuglens vinkelacceleration. Når kuglens centrum har flyttet sig vejen s1-s0 = 2,0 m parallelt med skråplanet, ønskes følgende beregnet: a) Den tid t1-t0. som kuglen har brugt, for at tilbagelægge de 2,0 m. b) Den hastighed, hvormed kuglens centrum bevæger sig til tiden t1 c) Kuglens kinetiske energi. d) Den potentielle energi, som kuglen har mistet ved bevægelsen.  29 Opgaver 15P59. a): 32,9 rad/s b): -28,5 rad/s c): 86 rad/s^2 30","libVersion":"0.2.4","langs":""}