{"path":"Lessons/Semester 3/datacommunication/KOM - lecture 5a - Itslearning.pdf","text":"Data Communication (DC) Lecture 5a - Random access • ALOHA • CSMA • CSMA/CD • CSMA/CA - Controlled access • Reservation • Polling • Token passing - Channelization • FDMA • TDMA • CDMA Overview of the contentsData Link layer Media Access Control Data Link layer Data Link Control Media Access Control In last lecture, we looked at Data Link Control, which deal with procedures for communication between two nodes, I.e., node- to-node communication. Today we are going to look at Media Access Control (MAC), which is the sublayer at the bottom As we shall see later, IEEE has actually made this division for LANs • The top sublayer is responsible for: Flow- and error-control and is called Logical Link Control (LLC). • The bottom sublayer is responsible for: multiple access control and is called Media Access Control (MAC). Data Link layer Media Access Control When nodes are connected in a common link, also called a multipoint or broadcast link, then we need to have a protocol that can handle and coordinate access to the link. The problem is handled by the protocols similar to the rules of speaking in an assembly: • The right to speak is maintained. • It is ensured that two people do not speak at the same time. • It is ensured that they do not interrupt each other. • It is ensured that the conversation does not develop into a monologue (i.e., only one gets speaking time) • And so on Data Link layer Media Access Control: Taxonomy Multi-access Protocols Random-access Protocols Controlled-access Protocols Channel-sharing Protocols - ALOHA - CSMA - CSMA/CD - CSMA/CA - Reservation - Polling - Token passing - FDMA - TDMA - CDMA Data Link layer Media Access Control: Random Access Random Access means: • that no nodes are more important than others, • that no nodes are assigned control over others, • that no nodes allow or forbid others to send, • that all nodes send whenever they want, provided that they follow some predefined procedure, which includes testing the state of the medium (busy/idle). Data Link layer Media Access Control: Random Access Since all nodes can send whenever they want, access conflict can occur, also called collision. The involved frames will either be destroyed or modified. To avoid this or solve the problem when it happens, all nodes follow procedures that answer the following questions: • When can a station access the medium? • What can a station do if the medium is busy? • How can a station determine a successful or faulty transmission? • What can a station do if there is an access conflict? Data Link layer Media Access Control: Pure ALOHA (University of Hawaii ca. 1970) The idea is that each station transmits when they have a frame to transmit. However, since there is only one channel to share, collisions may occur. (The dark durations in the figure) It is obvious that we need to recognize the frames involved in the collisions. Data Link layer Media Access Control: Pure ALOHA (University of Hawaii ca. 1970) In Pure ALOHA, the station transmitting a frame expects an ACK from the receiver once it has received the frame successfully. If the sender has not received an ACK before a timeout. Then it assumes that frame has been lost and resends it. If all the stations involved in a collision try to resend after a timeout, then the collision happens again. Pure ALOHA therefore dictates that: When the timeout period is over, each station waits for another random time period before resending. We call this random time period Backoff time TB. Pure ALOHA has another method to prevent the channel (medium) from being flooded with retransmitted frames. After a maximum number of retransmission attempts KMAX, the station gives up and tries again later. Data Link layer Media Access Control: Pure ALOHA Data Link layer Media Access Control: Pure ALOHA If we assume that frames have fixed sizes and it takes Tfr to send a frame, then it can be shown that the vulnerable time in such a system is 2xTfr: Data Link layer Media Access Control: Pure ALOHA – Throughput Where G is the average number of fames generated during a frame transmission time Tfr Throughput is the percentage of the frames which can reach their destination successfully. At max throughput, G=0.5, as the vulnerable time is 2 x Tfr. Which gives Smax=0,184 or 18,4% of the sent frames arrive without error. 𝑺 = 𝑮 ∙ 𝒆 −𝟐𝑮 Data Link layer Media Access Control: Slotted ALOHA If we divide the time in Slots and demand that the stations may only send frames at the beginning of a Slot, then we can reduce the vulnerable time to Tfr. If a station misses the starting moment of a slot, it must wait to transmit to the next slot. Data Link layer Media Access Control: Slotted ALOHA – Throughput At max throughput, G=1, as the most vulnerable time is Tfr. Which gives Smax=0,368 or 36,8% of the sent frames arrive without error. 𝑺 = 𝑮 ∙ 𝒆−𝑮 Data Link layer Media Access Control: Carrier Sense Multiple Access (CSMA) The risk of collision can be reduced if the station examines the medium before attempting to use it. The principle is called “sense before transmit” or “listen before talk”. CSMA can reduce the risk of errors, it can not eliminate it. Data Link layer Media Access Control: Carrier Sense Multiple Access (CSMA) If one station transmits and another station starts a transmission within this time period (TP) after the start of the first station’s transmission, then a collision is very likely to happen. Data Link layer Media Access Control: Carrier Sense Multiple Access (CSMA) Persistent methods What should a station do if the channel is busy? what should a station do if the channel is free? 3 methods have been developed to answer these questions: • 1-persistent method • Nonpersistent method • p-persistent method Data Link layer Media Access Control: Carrier Sense Multiple Access (CSMA) Persistent methods 1-persistent method is the simplest. Measure all the time until the medium is free, then send. This method has the highest risk of collision among the three methods. Ethernet uses this method. Data Link layer Media Access Control: Carrier Sense Multiple Access (CSMA) Persistent methods Nonpersistent method. A station has a frame to send. If the channel is free, it sends immediately. If the channel is busy, it waits a random amount of time and then sense the channel again. This reduces the risk of collision (compared to the first method). Data Link layer Media Access Control: Carrier Sense Multiple Access (CSMA) Persistent methods p-persistent method. This method is used if the channel is divided into time slots whose length is greater than or equal to the propagation time. This method combines the advantages of the two previous methods. This reduces the risk of collisions and improves efficiency. Data Link layer Carrier Sense Multiple Access with Collision Detection (CSMA/CD) • CSMA does not specify what to do if a collision occurs. • CSMA/CD describes an collision handling algorithm. To better understand CSMA/CD, let's look at the first bit transmitted by two stations involved in a collision… Data Link layer Carrier Sense Multiple Access with Collision Detection (CSMA/CD) Example: first bit • At time t1, station A performs its persistent procedure and starts the transmission of its frame. • At time t2, station C performs its persistent procedure and starts the transmission of its frame. • At some point after t2 (but before t3) the two frames collide. • At time t3, station C detects that the medium was not available anyway (sender A) and therefore interrupts its transmission. • At time t4, station A detects that the medium was not available anyway (sender C) and therefore interrupts its transmission. Data Link layer Carrier Sense Multiple Access with Collision Detection (CSMA/CD) If station A had finished transmitting before t4 (e.g., A’s Tframe < t4 – t1), then station A would no longer monitor the channel for collisions, thereby can not detect the collision, Which would not meet CD in CSMA/CD. Tframe must therefore be at least 2xTp (propagation) Data Link layer Carrier Sense Multiple Access with Collision Detection (CSMA/CD) Comparison with ALOHA ALOHA CSMA/CD just send when something should be sent. Here a persistent method is performed before sending something. send the entire frame and we are waiting for one ACK. It is constantly tested if a collision has occurred.(i.e., transmission and collision detection are continuous processes.). Nothing A Jamming signal is sent to make sure that all other stations become aware of the collision. Data Link layer Carrier Sense Multiple Access with Collision Detection (CSMA/CD) Data Link layer Carrier Sense Multiple Access with Collision Detection (CSMA/CD) If you measure the energy level of a channel, it can have 3 modes: • Transmission (normal) • Idle (zero) • Collision (abnormal) Data Link layer Carrier Sense Multiple Access with Collision Detection (CSMA/CD) Throughput The throughput at CSMA/CD is greater than at both Pure ALOHA and Slotted ALOHA. The throughput obviously depends on the value of the G value (and the p-value if the p-persistent method is used) • For 1-persistent method, the throughput is approx. 50% (at G=1) • For non-persistent method up to 90% (at G between 3 and 8) Data Link layer Carrier Sense Multiple Access with Collision Avoidance (CSMA/CA) As we saw, collisions could be detected by energy measurement. It is also easy enough in a wired system, where the energy is doubled in the event of a collision. But in a wireless system, much of the energy is lost in the transmission itself. Therefore, a collision may add only 5-10% extra energy. This provides no effective way to detect collisions. We must therefore avoid collisions in a wireless network because they can be difficult to detect. Data Link layer Carrier Sense Multiple Access with Collision Avoidance (CSMA/CA) Collisions are avoided using CSMA/CA's 3 strategies: • Interframe space • Contention window • Acknowledgment Data Link layer Carrier Sense Multiple Access with Collision Avoidance (CSMA/CA) Interframe Space (IFS) Collision is initially avoided by delaying the transmission even if the channel is found idle. The station does not transmit immediately. It awaits a period called Interframe Space (IFS). If the channel is still available after IFS, then the station is almost ready to transmit. It must first go through the Contention time (corresponding to the contention window). The time for IFS can be used to make priority, the shorter the time the higher the priority, and conversely the longer the time the lower the priority. This can apply to either the station or the importance of the transmitted frame. Data Link layer Carrier Sense Multiple Access with Collision Avoidance (CSMA/CA) Contention window This window consists of a certain amount of time, which is divided into slots. When a station is ready to send, it waits a random number of slots before it starts sending. The waiting time changes according to the binary exponential Backoff strategy. This means that the maximum value of the slot number is doubled every time the station cannot detect an idle channel after the IFS time. (this is very similar to the p-persistent method). Note that the station needs to sense the channel after each time slot: If the channel is busy, the timer is stopped until the channel is idle again. Then continue with the next time slot until the set number of time slots is expected. Data Link layer Carrier Sense Multiple Access with Collision Avoidance (CSMA/CA) Acknowledments Even though we have all these precautions, collisions can still occur which can corrupt our data. Therefore, an ACK and a time-out timer should help guarantee that the receiver has received the frame correctly. Data Link layer Carrier Sense Multiple Access with Collision Avoidance (CSMA/CA) Flow diagram Data Link layer Carrier Sense Multiple Access with Collision Avoidance (CSMA/CA) An example (figure on the next page) 1. Before sending a frame, the source station senses the medium by checking the energy level at the carrier frequency. a. The channel uses a persistent strategy with \"backoff\" until the channel is idle b. When the channel is found idle. The sender is waiting for a time called DCF interfarme space (DIFS). Then a control frame, Request To Send (RTS), is sent 2. After receiving RTS and waiting for a period called short interframe space (SIFS), the receiver sends a control frame: Clear To Send (CTS) to indicate that it is ready to receive data. 3. The sender sends data (after a SIFS period) 4. The receiver sends a receipt ACK. Note that this is necessary as the stations cannot use collision detection in CSMA/CD (only 5-10% extra energy is added in the carrier) Data Link layer Carrier Sense Multiple Access with Collision Avoidance (CSMA/CA)Carrier Sense Multiple Access with Collision Avoidance (CSMA/CA) A few things to note: • Since there is no collision detection, collisions can occur during the handshaking period if several stations send an RTS and do not receive a CTS (due to collision). Then the \"backoff\" strategy (random pause) is used before RTS is sent again. • In the figure, there is a field called NAV = Network Allocation Vector. Both RTS and CTS indicate the value of NAV in their control frame. The value is the duration of the time the channel is occupied by data traffic between sender and receiver. • We can see that a RTS-frame cannot reach C and D. That is why both RTS- and CTS-frames contain the value NAV. All stations that are not involved in the communication (here C and D) start a timer with the value of NAV to first check if it has expired before sensing the physical medium again. Data Link layerData Link layer Media Access Control: Controlled Access Reservation According to this method, a station must make a reservation before data can be transmitted. The time is divided into intervals. In each interval, a reservation frame is sent before data frames are sent. • If there are N stations in the system, then there are also N mini-slots in the reservation frame. • Each mini-slot belongs to a specific station. • When a station wants to send, it makes a reservation in its own mini-slot. • The stations that have reserved transmission time can transmit their data frames after reservation frame. Data Link layer Media Access Control: Controlled Access Polling Polling works with topologies, in which one station is designated as the primary station and other devices are secondary stations. All data exchange must take place through the primary station. • The primary station controls the link. • The secondary station follows the instructions of the primary station. • It is up to the primary station to decide who is allowed to use the channel at a given time. • The primary station is always the initiator of a session. 2 functions are used Data Link layer Media Access Control: Controlled Access Select (SEL) This function is used when the primary station has something to send. Remember that the primary station controls the link. • First, SEL is sent and an ACK is awaited. • Then data is sent and an ACK is awaited. Data Link layer Media Access Control: Controlled Access Poll This function is used by the primary station when it wants to request transmission from the secondary station. When the primary station is ready to receive data, it (polls) asks the secondary stations in turn if they have anything to send. • If a secondary station has nothing to transmit, it sends a NAK. • If a secondary station has something to send, it sends its data and waits for an ACK. Data Link layer Media Access Control: Controlled Access Token Passing In this method, the stations are organized in a logical ring. In other words, there is a predecessor and a successor to each station in the network. • The station that has the token right now also has access to the channel. • When the current station has no more to send, it passes the token on to its successor. How is such a token passed on to the next station? • In this method, a special packet (token) circulates around the ring. • When a station has some data to send, it waits until it receives the token from its predecessor. • When it receives the token, it sends its data. • It then passes the token on to its successor when it has no more data to send Data Link layer Media Access Control: Controlled Access Token Passing However, some overall management is needed in connection with the token: • The time a station can have a token must be limited. • The token must be monitored to ensure that it is not lost or destroyed. • Priority must be given to stations and types of data that are transmitted. • A low priority station should only be forced to hand over the token to a higher priority station. Data Link layer Media Access Control: Controlled Access Examples of logical ring topology Data Link layer Media Access Control: Channelization Channel partition Channel partition is a multi-access method where the available bandwidth of a link is shared in: • Frequency • Time • Through coding … among different stations We look at the following channel partition protocols: • Frequency-Division Multiple Access (FDMA) • Time-Division Multiple Access (TDMA) • Code-Division Multiple Access (CDMA) Data Link layer Media Access Control: Channelization Frequence-Division Multiple Access (FDMA) Here the bandwidth is divided into frequency bands. Each station is allocated to a frequency band where it can transmit its data. This frequency band belongs to the station at all times. To avoid interference, the frequency bands are separated by a narrow Guard band. e.g., telephony) Data Link layer Media Access Control: Channelization Time-Division Multiple Access (TDMA) Here the bandwidth in the link is divided in time. Each station has its own time slot in which it can send data. The data stream is divided into packets. Data Link layer Media Access Control: Channelization Time-Division Multiple Access (TDMA) • The main problem with TDMA lies in achieving synchronization between the individual stations. • Each station must know when its time slot starts. • This can be difficult if the stations are spread over a larger area, because then propagation delays must also be taken into account. • However, we can compensate for this by inserting guard times between the time slots. • Synchronization is usually achieved by having some synchronization bits at the beginning of each time slot. Data Link layer Media Access Control: Channelization Code-Division Multiple Access (CDMA) The idea for CDMA was conceived decades ago, but recent advances in electronic technology have finally made its implementation possible. • CDMA differs from FDMA because only one channel has the full bandwidth of the link. • CDMA differs from TDMA because all stations can broadcast simultaneously. There is no timesharing. Let us assume that 4 stations 1, 2, 3 and 4 are connected to the same channel. • Data from station 1 is d1, data from station 2 is d2 and so on • The code associated with station 1 is c1, the code associated with station 2 is c2 and so on We assume the associated codes have two properties. 1. If we multiply one code by another, we get the result 0. 2. If we multiply a code by itself, then we get the number of stations (here 4) Data Link layer Media Access Control: Channelization Code-Division Multiple Access (CDMA) Media Access Control: Channelization Code-Division Multiple Access (CDMA): example Station 1 and 2 communicate with each other. Station 2 want to see what station 1 is broadcasting. Therefore, station 2 multiplies the data on the channel with station 1’s code c1. • c1· c1=4 (property 2) • c1· c2=0 (property 1) • c1· c3=0 (property 1) • c1· c4=0 (property 1) then, by dividing by 4, station 2 will be able to find out what station 1 has sent. Data Link layer 𝑑𝑎𝑡𝑎 = (𝑑1 ∙ 𝑐1 + 𝑑2 ∙ 𝑐2 + 𝑑3 ∙ 𝑐3 + 𝑑4 ∙ 𝑐4) ∙ 𝑐1 𝑑𝑎𝑡𝑎 = (𝑑1 ∙ 𝑐1 ∙ 𝑐1 + 𝑑2 ∙ 𝑐2 ∙ 𝑐1 + 𝑑3 ∙ 𝑐3 ∙ 𝑐1 + 𝑑4 ∙ 𝑐4 ∙ 𝑐1) 𝑑𝑎𝑡𝑎 = 4 ∙ 𝑑1 Data Link layer Media Access Control: Channelization Code-Division Multiple Access (CDMA): chip sequences c1 c2 c3 c4 [+1 +1 +1 +1] [+1 -1 +1 -1] [+1 +1 -1 -1] [+1 -1 -1 +1] E.g., c1· c1 [+1 + 1 + 1 + 1] ∙ [+1 + 1 + 1 + 1] = 1 + 1 + 1 + 1 = 4 Property 2 E.g., c1· c2 [+1 + 1 + 1 + 1] ∙ [+1 − 1 + 1 − 1] = 1 − 1 + 1 − 1 = 0 Property 1 Data Link layer Media Access Control: Channelization Code-Division Multiple Access (CDMA): Data representation • A bit that is 0 is presented as -1 • A bit that is 1 is presented as +1 • If nothing is sent, it is presented as 0 Let's take an example… Data Link layer Media Access Control: Channelization Code-Division Multiple Access (CDMA): example Data Link layer Media Access Control: Channelization Code-Division Multiple Access (CDMA): example Another way to show the same: Data Link layer Media Access Control: Channelization Code-Division Multiple Access (CDMA): example Station 3 want to see what station 2 has sent (the bit was 0): Data Link layer Media Access Control: Channelization Code-Division Multiple Access (CDMA): Walsh tables C1 C2 C3 C4","libVersion":"0.2.4","langs":""}